[
    {
        "class_id": "20240727suriya-kriya",
        "yoga_id": "suriya-kriya",
        "name": "Suriya Kriya",
        "start_date": "Saturday, July 27, 2024",
        "end_date": "Sunday, July 28, 2024",
        "sessions": "Saturday, Jul 27th, 8:00 AM - 11:30 AM\nSaturday, Jul 27th, 4:30 PM - 8:00 PM",
        "street_1": "49 Midway Dr",
        "street_2": null,
        "city": "Mc Kees Rocks",
        "state": "Pennsylvania",
        "zipcode": "15136",
        "fee": 225,
        "phone": "412-862-5007",
        "email": "hellograceyoga@gmail.com",
        "description": "Traditionally available only to select groups of yogis, Surya Kriya is being offered by Sadhguru as a comprehensive spiritual practice that is ideal for the hectic pace of today's world.\n\n\"Surya\" means \"sun\", and \"Kriya\" means \"inner energy process\". It is a gentle, slow-paced, 21-step process and is a way of aligning yourself with the sun, the basic powerhouse for this planet. All life on this planet is solar powered, including yourself.\n\nSurya Kriya is an ancient, potent yogic practice that raises the solar heat in the system. It also balances your energy channels, leading to stability of the body and stillness of the mind.",
        "guidelines": "Due to the nature of the practices, we request you to maintain an empty stomach condition when you come for the session. There should be a gap of:\n-4 hours from the last full meal\n-2.5 hours from the last snack\n-1.5 hours from the last beverage (excluding water)\n\nDue to the nature of this practice, there are some precautions. People who fall under any of the below categories are not eligible to participate at this time:\n-Women who are currently pregnant\n-Anyone who has had a major open surgery in the last 6 months\n-Anyone who has had laproscopic surgery within the last 6 weeks\n\nAs a general note, always consult and follow your doctor's advice. If you have any questions regarding your participation, please contact us.",
        "prerequisites": "Anyone above 14 years of age can attend. No previous experience of yoga required.",
        "video": "https://www.youtube.com/embed/UccxdrQCL-M"
    }
]